const ch = {
  hello: {
    welcome: '欢迎来到我的',
    portfolioTitle: '作品集',
    heroBottom: `我喜欢了解事物的运作方式，\n这就是我为什么对人工智能和\n网站开发感兴趣。`,
    instaHandle: '> @felipe_sbm <'
  },
  about: {
    title: '妮好，\n 我是费利佩',
    placeholder: '在此处插入您的文本。此区域已准备好容纳段落、列表或您想添加的任何内容。',
    paragraph1: '我是一名人工智能工程师和软件开发人员。目前我正在学习中国文化，以建立从巴西到中国的社会桥梁。',
    paragraph2: '您可以在GitHub上找到我。我正在创建一个名为Nova.jl的Julia Web框架。',
    aboutMeTitle: '关于我',
    badges: [
      '巴西人 🇧🇷',
      '中文讲者 🗣️',
      '设计师 🎨',
      '音乐家 🎵',
      '博主 ✍️'
    ]
  }
  ,
  header: {
    brand: {
      first: '十恩',
      last: 'SBM',
      logoAlt: '我的官方标志',
      selectAlt: '任天堂3ds选择图标'
    },
    nav: {
      welcome: '欢迎',
      about: '关于我',
      projects: '项目',
      guestbook: '留言簿'
    },
    langToggle: {
      title: '切换语言'
    }
  },
  resume: {
    educationTitle: '教育',
    experienceTitle: '经验',
    programmingLanguagesTitle: '编程语言',
    experiences: [
      {
        role: '平面设计师',
        company: '自由职业者',
        period: '2018至2022年',
        description: '创建视觉概念以传达激励和吸引消费者的想法。'
      },
      {
        role: '人工智能专业实习生',
        company: 'Outlier AI',
        period: '2024至2025年',
        description: '协助使用C++为各种应用程序测试AI模型。'
      },
      {
        role: '软件工程实习生',
        company: 'Arkanus',
        period: '2024-现在',
        description: '领导使用TypeScript框架和现代技术开发Web应用程序。'
      },
      {
        role: '人工智能专业技术人员',
        company: '里奥格兰德北联邦大学',
        period: '2025年',
        description: '专门研究机器学习模型和数据分析。'
      }
    ]
  }
} as const

export default ch
